#include <iostream>  // Для вывода в консоль

//пример
//решение линейных уравнений ax + b = c
double linear(double a, double b, double c) {
    return (c - b) / a;
}

//решение квалратичных уравнений ax*x + bx + c = 0
// D = sqrt(b*b - 4*a*c)
// x1 = ... x2 = ... не помню формулу)
//прoоблема - корня 2, а функция в С++ не возвращает 2 аргумента
//можно сделать через ссылку &x1 &x2. если принмать по ссылке то при выходе из функции x1 x2 изменятся.
void kvadrat(double a, double b, double c, double& x1, double& x2) {
    
    //считаешь дискриминант D = ...
    //x1 = D - ...
    //x1 = D + ...

}

//расстояние между двумя точками на плоскости
// есть точка 1 (x1, y1) и точка 2 (x2, y2)
// sqrt((x1-x2)*(x1-x2) + (y1-y2)*(y1-y2)) 
//например (1,1) и (2, 1) будет 2
double length(double x1, double y1, double x2, double y2)
{
    
}

//игра угадай число
//надо почитать про циклы
void guessNumber()
{
    const int guessedNumber = 156;  // для простоты игрок пусть угадывает постоянное число 156

    int number = 0;
    //цикл
    //    читаем число std::cin >> number;
    //    проверяем больше меньше чем 156 
    //    если меньше выводим меньше if (number < 156) std::cout << "меньше" << std::endl;
    //    если больше выводим больше
    //    если равно выводим "угадал" и завершение игры выходим из функции return;

}







int main() {

    std::cout << "решение линейного уравнения. введите a \n";
    double a=0, b=0, c=0;
    
    std::cin >> a;

    std::cout << "введите b \n";
    std::cin >> b;

    std::cout << "введите c \n";
    std::cin >> c;

    double result = linear(a, b, c);

    std::cout << "решение линейного уравнения. резудьтат " << result;



    // то же самое делаем для квадратичного уравнения
    // ..


    //потом запускаем "угадай число"
    guessNumber();


    return 0;
}